; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	infrared1 - mode
	image2 - mode
	thermograph3 - mode
	Star0 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star9 - direction
	Star12 - direction
	GroundStation2 - direction
	Star8 - direction
	Star11 - direction
	GroundStation4 - direction
	GroundStation10 - direction
	Star1 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph3)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star11)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Planet13 image2)
	(have_image Star14 thermograph3)
	(have_image Star15 infrared1)
	(have_image Star16 thermograph3)
	(have_image Phenomenon17 thermograph3)
))

)

; plan
1. (turn_to satellite0 groundstation10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation10)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 planet13 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet13)
   goals met: 0 of 6
5. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon17 instrument1 thermograph3)
   added: (have_image phenomenon17 thermograph3)
   goals met: 2 of 6
8. (turn_to satellite0 star14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star14)
   goals met: 2 of 6
9. (take_image satellite0 star14 instrument1 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 3 of 6
10. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 3 of 6
11. (take_image satellite0 star15 instrument1 infrared1)
   added: (have_image star15 infrared1)
   goals met: 4 of 6
12. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
13. (take_image satellite0 star16 instrument1 thermograph3)
   added: (have_image star16 thermograph3)
   goals met: 5 of 6
14. (turn_to satellite0 groundstation5 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation5)
   goals met: 6 of 6
